app/controllers/songs_controller.rb

  def edit
    @artist = Artist.find_by(id: params[:artist_id])
    if !@artist.nil?
      if @artist.songs.include? params[:id]
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
SELECT  1 AS one FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT "artists".* FROM "artists"